# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в 
# его стихах ритм. Поскольку разобраться в его кричалках не 
# настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, 
# если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. 
# Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если
#  с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

count = 0

vowels = 'аеуюяиэо'  # список гласных букв

poem = input('Введите фразу')

words = poem.split()  # Разделяем стихотворение на слова

vowels_count = []  # Список количеств гласных букв в каждом слове

def count_vowels(word):
    for letter in word:
        if letter.lower() in vowels:
        count += 1
print(count)

for word in words:
    count = count_vowels(word)
vowels_count.append(count)

if len(set(vowels_count)) == 1:  # Проверяем, что все слова имеют одинаковое количество гласных
    print("Парам пам-пам")
else:
    print("Пам парам")



